Для выполнения заданий возьмите данные из папки data о продажах. Данные распределены по 4 папкам:


*  sales_train.csv - данные о продажах с января 2013 по октябрь 2015.

  *   date - дата продажы
  *   date_block_num - номер месяца по порядку следования
  *   shop_id - идентификатор магазина
  *   item_id - идентификатор товара
  *  item_cnt_day - количество проданного товара одного вида в день
*   items.csv - подробная информация о товарах
  *   item_id - идентификатор товара
  *   item_name - название товара
  *   category_id - идентификатор категории товара
*   item_categories.csv - подробная информация о категориях товаров
  *   item_category_id - идентификатор категории товара
  *   category_name - название категории товара
*   shops.csv - подробная информация о магазинах
  * shop_id - идентификатор магазина
  * shop_name - название магазина

# Задание 1


1.   Найдите топ-10 самых часто покупаемых товаров (не забудьте учесть столбец item_cnt_day).
2.   Оставьте только те из них, которые покупали все три года (2013, 2014, 2015).

In [ ]:
sales_train <- read.csv('https://drive.google.com/uc?export=download&confirm=no_antivirus&id=1jSJU4h7A-TNKuWH0ClzYx3dfCJiTD21g')
item_categories <- read.csv('https://drive.google.com/uc?export=download&confirm=no_antivirus&id=1oIUxVxRLj03vVHShVCay8ZHW9a9D9M0m')
items <- read.csv('https://drive.google.com/uc?export=download&confirm=no_antivirus&id=1QdYmeqN_oq_fcbe77SX7xb_hCviNd0HO')
shops <- read.csv('https://drive.google.com/uc?export=download&confirm=no_antivirus&id=1gRFn6w4uRFoUmbZrjaspLjJdtRCMzxyx')
library(dplyr)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [ ]:
#1.1
result = sales_train %>%
           group_by(item_id) %>%
           summarise(total_sales = sum(item_cnt_day))

result = result[order(result$total_sales, decreasing = TRUE), ]
result = head(result, n=10)
result

   item_id total_sales
1  20949   187642
2   2808    17245
3   3732    16642
4  17717    15830
5   5822    14515
6   3734    11688
7   6675    10289
8   3731    10099
9   1855    10032
10 16787     9227

In [ ]:
#1.2
sales_copy <- sales_train

rule36 <- filter(sales_copy, date_block_num >= 24 & date_block_num < 36)
rule24 <- filter(sales_copy, date_block_num >= 12 & date_block_num < 24)
rule12 <- filter(sales_copy, date_block_num < 12)

result[(result$item_id %in% rule12$item_id) & (result$item_id %in% rule24$item_id) & (result$item_id %in% rule36$item_id), ]

  item_id total_sales
1 20949   187642
2  2808    17245
3  3732    16642
4 17717    15830
5  5822    14515
6  3734    11688
7  6675    10289
8  1855    10032
9 16787     9227

# Задание 2

1.   Определите категорию товаров, в которой совершается минимальное число покупок. Выведите айди и название категории.
2.   Определите категорию товаров, в которой совершается максимальное число покупок. Выведите айди и название категории.

In [ ]:
items_copy <- items
sales_newcopy <- sales_train

items_frame <- merge(sales_newcopy, items_copy, by='item_id')
items_frame = items_frame %>%
                  group_by(category_id) %>%
                  summarise(total_sales = sum(item_cnt_day))

max_cat <- items_frame[items_frame$total_sales == max(items_frame$total_sales), ]
min_cat <- items_frame[items_frame$total_sales == min(items_frame$total_sales), ]
#items_frame[which.max(items_frame$total_sales), ]

print('Минимальные категории')
item_categories[item_categories$item_category_id %in% min_cat$category_id, ]
print('Максимальная категория')
item_categories[item_categories$item_category_id %in% max_cat$category_id, ]

[1] "Минимальные категории"

   item_category_name            item_category_id
11  Game consoles - PS2          10
52  Books - Cognitive literature 51

[1] "Максимальная категория"

   item_category_name item_category_id
41  Cinema - DVD      40

# Задание 3

1.   Для категорий из задания 2 найдите среднее количество продаж каждого товара категории в 5 магазинах с наибольшими продажами.
2.   Найдите месяцы с минимальными и максимальными продажами для каждого товара из пункта 1.

In [ ]:
#3.1
shop_sales <- sales_train
sales_frame <- sales_train
items_newcopy <- items

shop_sales <- shop_sales %>%
              group_by(shop_id) %>%
              summarise(total_sales = sum(item_cnt_day))
shop_sales <- head(shop_sales[order(shop_sales$total_sales, decreasing = TRUE), ], 5)

sales_frame <- merge(sales_frame, items_newcopy, by = 'item_id')

min_frame <- sales_frame[(sales_frame$category_id %in% min_cat$category_id), ]

min_frame <- min_frame[min_frame$shop_id %in% shop_sales$shop_id, ]

min_frame <- min_frame %>%
                group_by(item_id, shop_id) %>%
                summarise(total_sales = sum(item_cnt_day))



min_frame <- min_frame %>%
                group_by(item_id) %>%
                summarise(mean_sales = mean(total_sales))

min_frame
#продаж для минимальной категории нет в топовых магазинах

`summarise()` has grouped output by 'item_id'. You can override using the
`.groups` argument.

     item_id mean_sales

In [ ]:
max_frame <- sales_frame[(sales_frame$category_id %in% max_cat$category_id), ]

max_frame <- max_frame[max_frame$shop_id %in% shop_sales$shop_id, ]

max_frame <- max_frame %>%
                group_by(item_id, shop_id) %>%
                summarise(total_sales = sum(item_cnt_day))



max_frame <- max_frame %>%
                group_by(item_id) %>%
                summarise(mean_sales = mean(total_sales))

max_frame

`summarise()` has grouped output by 'item_id'. You can override using the
`.groups` argument.

     item_id mean_sales
1     0        1.000000
2     2        2.000000
3     3        2.000000
4     4        1.000000
5     5        1.000000
6     6        1.000000
7     7        1.000000
8     8        2.000000
9     9        1.000000
10   10        1.000000
11   11        1.000000
12   13        1.000000
13   14        1.000000
14   15        1.000000
15   18        1.000000
16   19        1.000000
17   20        1.000000
18   21        1.000000
19   22        1.000000
20   23        1.000000
21   24        1.000000
22   25        1.000000
23   26        1.000000
24   30      172.000000
25   32      166.600000
26   34        7.800000
27   35       18.000000
28   37       12.400000
29   43        1.000000
30   63        1.333333
⋮    ⋮       ⋮
4685 22075    3.500000
4686 22108    1.000000
4687 22114    8.000000
4688 22116    2.000000
4689 22119    6.600000
4690 22120    2.800000
4691 22121   36.800000
4692 22123    5.400000
4693 22124    1.000000
4694 22126   19.400000
4695 22128    3.333333
4696 22129    2.250000
4697 22130   26.200000
4698 22132    9.000000
4699 22133    4.600000
4700 22134   24.800000
4701 22136    5.200000
4702 22141    6.200000
4703 22143   54.600000
4704 22147    5.500000
4705 22148    1.000000
4706 22149    3.000000
4707 22151   30.800000
4708 22152    5.250000
4709 22156    1.000000
4710 22157    1.000000
4711 22159    2.000000
4712 22160    4.500000
4713 22162   55.400000
4714 22163    9.750000

In [ ]:
#3.2
sales_frame <- sales_train
items_newnewcopy <- items

sales_newframe <- merge(sales_frame, items_newnewcopy, by = 'item_id')

max_months <- sales_newframe[(sales_newframe$item_id %in% max_frame$item_id) | (sales_newframe$item_id %in% min_frame$item_id), ]

max_months <- max_months %>%
                group_by(item_id, date_block_num) %>%
                summarise(total_sales = sum(item_cnt_day))

min_months <- max_months[order(max_months$item_id, max_months$total_sales, decreasing = FALSE), ]
min_months <- distinct(min_months, item_id, .keep_all = TRUE)

max_months <- distinct(max_months, item_id, .keep_all = TRUE)
max_months

`summarise()` has grouped output by 'item_id'. You can override using the
`.groups` argument.

     item_id date_block_num total_sales
1     0      20               1
2     2      19               1
3     3      18               1
4     4      20               1
5     5      23               1
6     6      18               1
7     7      23               1
8     8      19               1
9     9      19               1
10   10      24               1
11   11      22               1
12   13      20               1
13   14      23               1
14   15      22               1
15   18      19               1
16   19       0               1
17   20      19               1
18   21      20               1
19   22      27               1
20   23      25               1
21   24      27               1
22   25      19               1
23   26      21               1
24   30       1             861
25   32       0             299
26   34       0               9
27   35       0              78
28   37       2              11
29   43       0               2
30   63       0               4
⋮    ⋮       ⋮              ⋮
4685 22075    0               7
4686 22108    0               2
4687 22114    3              20
4688 22116    0               1
4689 22119    0               3
4690 22120    3               5
4691 22121    6             109
4692 22123    9               6
4693 22124    0               4
4694 22126    9              66
4695 22128    0               4
4696 22129    0               2
4697 22130    0             160
4698 22132    2               4
4699 22133   13               3
4700 22134    0             224
4701 22136    2              10
4702 22141   13               9
4703 22143   14             571
4704 22147    0               5
4705 22148    5               1
4706 22149    0               5
4707 22151    0             276
4708 22152    2               9
4709 22156    2               2
4710 22157    1               1
4711 22159   28              12
4712 22160    0              11
4713 22162   18               1
4714 22163   31              29

In [ ]:
min_months

     item_id date_block_num total_sales
1     0      20              1
2     2      19              1
3     3      18              1
4     4      20              1
5     5      23              1
6     6      18              1
7     7      23              1
8     8      19              1
9     9      19              1
10   10      24              1
11   11      22              1
12   13      20              1
13   14      23              1
14   15      22              1
15   18      19              1
16   19       0              1
17   20      19              1
18   21      20              1
19   22      27              1
20   23      25              1
21   24      27              1
22   25      19              1
23   26      21              1
24   30      33              1
25   32      18             12
26   34      10              1
27   35      14              1
28   37      13              1
29   43       3              1
30   63       5              1
⋮    ⋮       ⋮              ⋮
4685 22075   11              1
4686 22108    5              1
4687 22114    7              2
4688 22116    0              1
4689 22119   11              1
4690 22120    4              1
4691 22121   10              6
4692 22123   14              1
4693 22124    1              1
4694 22126   19              1
4695 22128    3              1
4696 22129    1              1
4697 22130    3             -1
4698 22132    9              1
4699 22133   21              1
4700 22134   14              1
4701 22136   13              1
4702 22141   16              2
4703 22143   22              8
4704 22147    6              1
4705 22148    5              1
4706 22149    2              1
4707 22151    5              1
4708 22152    9              1
4709 22156    4              1
4710 22157    1              1
4711 22159   29              3
4712 22160   17              1
4713 22162   18              1
4714 22163   32             20

# Задание 4

1.   Для категорий из задания 2 найдите среднюю и медианную цену по категории в пределах каждого месяца.
2.   В каждом году найдите месяцы, в которых средняя цена меньше, чем в предыдущем и следующем месяце.

In [ ]:
#4.1 
jeneral_category <- max_frame %>%
                      full_join(min_frame)
sales_newframe <- sales_newframe[sales_newframe$item_id %in% jeneral_category$item_id, ]

sales_mean <- sales_newframe %>%
                group_by(date_block_num, category_id) %>%
                summarise(mean_price = mean(item_price))

sales_mean

Joining, by = c("item_id", "mean_sales")
`summarise()` has grouped output by 'date_block_num'. You can override using
the `.groups` argument.

   date_block_num category_id mean_price
1   0             40          244.8589
2   1             40          252.3997
3   2             40          260.8980
4   3             40          254.9732
5   4             40          247.7220
6   5             40          245.9637
7   6             40          236.8638
8   7             40          234.4875
9   8             40          241.8383
10  9             40          247.5742
11 10             40          253.2233
12 11             40          257.8082
13 12             40          252.9211
14 13             40          261.2565
15 14             40          262.4795
16 15             40          268.4429
17 16             40          254.3645
18 17             40          255.1590
19 18             40          257.4465
20 19             40          264.1878
21 20             40          265.3975
22 21             40          263.7609
23 22             40          264.0252
24 23             40          261.8757
25 24             40          263.1706
26 25             40          256.3622
27 26             40          258.2083
28 27             40          281.6243
29 28             40          286.4941
30 29             40          279.1115
31 30             40          273.2369
32 31             40          273.1803
33 32             40          279.2725
34 33             40          280.4718

In [ ]:
sales_median <- sales_newframe %>%
                group_by(date_block_num, category_id) %>%
                summarise(median_price = median(item_price))

sales_median

`summarise()` has grouped output by 'date_block_num'. You can override using
the `.groups` argument.

   date_block_num category_id median_price
1   0             40          199
2   1             40          203
3   2             40          231
4   3             40          199
5   4             40          199
6   5             40          199
7   6             40          149
8   7             40          149
9   8             40          198
10  9             40          199
11 10             40          199
12 11             40          237
13 12             40          199
14 13             40          248
15 14             40          251
16 15             40          249
17 16             40          199
18 17             40          199
19 18             40          199
20 19             40          199
21 20             40          240
22 21             40          199
23 22             40          199
24 23             40          199
25 24             40          199
26 25             40          199
27 26             40          169
28 27             40          299
29 28             40          299
30 29             40          249
31 30             40          199
32 31             40          249
33 32             40          249
34 33             40          249

In [ ]:
year2013 <- sales_mean[(sales_mean$date_block_num < 12), ]

for (i in 2 : (nrow(year2013) - 1))
{
  if((year2013[i, 'mean_price'] < year2013[i-1, 'mean_price']) & (year2013[i, 'mean_price'] < year2013[i+1, 'mean_price']))
  {
    print(year2013[i, ])
  }
}

# A tibble: 1 × 3
# Groups:   date_block_num [1]
  date_block_num category_id mean_price
           <int>       <int>      <dbl>
1              7          40       234.

In [ ]:
year2014 <- sales_mean[(sales_mean$date_block_num < 24) & (sales_mean$date_block_num >= 12), ]

for (i in 2 : (nrow(year2014) - 1))
{
  if((year2014[i, 'mean_price'] < year2014[i-1, 'mean_price']) & (year2014[i, 'mean_price'] < year2014[i+1, 'mean_price']))
  {
    print(year2014[i, ])
  }
}

# A tibble: 1 × 3
# Groups:   date_block_num [1]
  date_block_num category_id mean_price
           <int>       <int>      <dbl>
1             16          40       254.
# A tibble: 1 × 3
# Groups:   date_block_num [1]
  date_block_num category_id mean_price
           <int>       <int>      <dbl>
1             21          40       264.

In [ ]:
year2015 <- sales_mean[(sales_mean$date_block_num < 36) & (sales_mean$date_block_num >= 24), ]

for (i in 2 : (nrow(year2015) - 1))
{
  if((year2015[i, 'mean_price'] < year2015[i-1, 'mean_price']) & (year2015[i, 'mean_price'] < year2015[i+1, 'mean_price']))
  {
    print(year2015[i, ])
  }
}

# A tibble: 1 × 3
# Groups:   date_block_num [1]
  date_block_num category_id mean_price
           <int>       <int>      <dbl>
1             25          40       256.
# A tibble: 1 × 3
# Groups:   date_block_num [1]
  date_block_num category_id mean_price
           <int>       <int>      <dbl>
1             31          40       273.